server/src/tests/performanceTest/missingPersonTest/stress-test.yml
config:
  target: 'http://localhost:5000'
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Baseline"
    - duration: 120
      arrivalRate: 10
      name: "Medium stress"
    - duration: 180
      arrivalRate: 15
      name: "High stress"
    - duration: 120
      arrivalRate: 20
      name: "Maximum stress"
    - duration: 60
      arrivalRate: 5
      name: "Recovery"
  defaults:
    headers:
      Content-Type: "application/json"
  timeout: 30
  payload:
    path: "missing-test-users.csv"
    fields:
      - "email"
      - "password"

scenarios:
  - name: "Missing Person - Full Read Flow Stress"
    weight: 70
    flow:
      - get:
          url: "/api/missing-persons/statistics"
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: "/api/missing-persons"
          expect:
            - statusCode: 200

  - name: "Missing Person - Create Report Stress"
    weight: 30
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "authToken"
      - think: 1
      - post:
          url: "/api/missing-persons"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            name: "Stress Test Person {{ $randomNumber(10000, 99999) }}"
            age: 30
            gender: "Female"
            lastSeenLocation: "Galle"
            description: "Stress test entry"
            status: "Missing"
            contactName: "Stress Contact"
            contactPhone: "0710000000"
          expect:
            - statusCode: 201